Model: "model_doubleconv64_opt=adamax_ker=5_drop=20.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_25 (Conv2D)           (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 384)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_14 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
