Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_27 (Conv2D)           (None, 32, 48, 48)        896       
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 32, 24, 24)        0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 64, 22, 22)        18496     
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 64, 11, 11)        0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 64, 11, 11)        0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 128, 11, 11)       73856     
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 256, 9, 9)         295168    
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 256, 4, 4)         0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 256, 4, 4)         0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 4096)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 9)                 36873     
=================================================================
Total params: 425,289
Trainable params: 425,289
Non-trainable params: 0
_________________________________________________________________
