Model: "model_doubleconv64_opt=rmsprop_ker=7_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_53 (Conv2D)           (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_28 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
