Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_23 (Conv2D)           (None, 64, 48, 48)        1792      
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 64, 24, 24)        0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 128, 22, 22)       73856     
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 128, 11, 11)       0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 128, 11, 11)       0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 256, 11, 11)       295168    
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 256, 5, 5)         0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 512, 3, 3)         1180160   
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 512, 1, 1)         0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 512, 1, 1)         0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 9)                 4617      
=================================================================
Total params: 1,555,593
Trainable params: 1,555,593
Non-trainable params: 0
_________________________________________________________________
