Model: "model_doubleconv64_opt=adam_ker=3_drop=50.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_77 (Conv2D)           (None, 32, 48, 1)         13856     
_________________________________________________________________
conv2d_78 (Conv2D)           (None, 32, 48, 1)         9248      
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_39 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_79 (Conv2D)           (None, 64, 24, 1)         9280      
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 64, 24, 1)         36928     
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_40 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_20 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_40 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 170,185
Trainable params: 170,185
Non-trainable params: 0
_________________________________________________________________
