Model: "model_doubleconv64_opt=adamax_ker=7_drop=10.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_81 (Conv2D)           (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_82 (Conv2D)           (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_41 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_83 (Conv2D)           (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_84 (Conv2D)           (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_42 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_21 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_41 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_42 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
