Model: "model_doubleconv_32_act=relu_opt=adam_ker=3_pad=same_drop=20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 32, 48, 1)         13856     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 32, 48, 1)         9248      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 16, 24, 1)         0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 384)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_18 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 123,977
Trainable params: 123,977
Non-trainable params: 0
_________________________________________________________________
