Model: "model_doubleconv_128_act=relu_opt=adam_ker=3_pad=same_drop=20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 48, 3)         13856     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 48, 3)         9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 24, 3)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 24, 3)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 24, 3)         9280      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 24, 3)         36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 12, 3)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 12, 3)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 12, 3)        36992     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 128, 12, 3)        147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 64, 6, 3)          0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 64, 6, 3)          0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 1152)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 256)               295168    
_________________________________________________________________
dense_6 (Dense)              (None, 9)                 2313      
=================================================================
Total params: 551,369
Trainable params: 551,369
Non-trainable params: 0
_________________________________________________________________
