Model: "model_doubleconv64_opt=adam_ker=5_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_153 (Conv2D)          (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_154 (Conv2D)          (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_77 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_77 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_155 (Conv2D)          (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_156 (Conv2D)          (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_78 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_78 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_39 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_77 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_78 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
