Model: "model_doubleconv64_opt=adam_ker=5_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_177 (Conv2D)          (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_178 (Conv2D)          (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_93 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_85 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_179 (Conv2D)          (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_180 (Conv2D)          (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_94 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_86 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_55 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_109 (Dense)            (None, 256)               98560     
_________________________________________________________________
dense_110 (Dense)            (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
