Model: "model_doubleconv_256_act=relu_opt=adam_ker=3_pad=same_drop=20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 32, 48, 1)         13856     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 32, 48, 1)         9248      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 64, 24, 1)         9280      
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 64, 24, 1)         36928     
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 32, 12, 1)         0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 128, 12, 1)        36992     
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 128, 12, 1)        147584    
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 64, 6, 1)          0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 64, 6, 1)          0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 256, 6, 1)         147712    
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 256, 6, 1)         590080    
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 128, 3, 1)         0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 128, 3, 1)         0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_23 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_24 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 1,092,553
Trainable params: 1,092,553
Non-trainable params: 0
_________________________________________________________________
