Model: "model_doubleconv64_opt=adamax_ker=7_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_173 (Conv2D)          (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_174 (Conv2D)          (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_87 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_87 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_175 (Conv2D)          (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_176 (Conv2D)          (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_88 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_88 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_44 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_87 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_88 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
