Model: "model_doubleconv_nodrop_256_opt=adam_ker=3_drop=20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 48, 3)         13856     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 48, 3)         9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 24, 3)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 24, 3)         9280      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 24, 3)         36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 12, 3)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 12, 3)        36992     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 128, 12, 3)        147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 64, 6, 3)          0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 256, 6, 3)         147712    
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 256, 6, 3)         590080    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 128, 3, 3)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 1152)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 256)               295168    
_________________________________________________________________
dense_8 (Dense)              (None, 9)                 2313      
=================================================================
Total params: 1,289,161
Trainable params: 1,289,161
Non-trainable params: 0
_________________________________________________________________
