Model: "model_doubleconv64_opt=sgd_ker=5_drop=10.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_225 (Conv2D)          (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_226 (Conv2D)          (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_117 (MaxPoolin (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_109 (Dropout)        (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_227 (Conv2D)          (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_228 (Conv2D)          (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_118 (MaxPoolin (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_110 (Dropout)        (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_67 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_133 (Dense)            (None, 256)               98560     
_________________________________________________________________
dense_134 (Dense)            (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
