Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_13 (Conv2D)           (None, 32, 48, 48)        896       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 64, 46, 46)        18496     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 64, 23, 23)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 64, 23, 23)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 33856)             0         
_________________________________________________________________
dense_7 (Dense)              (None, 9)                 304713    
=================================================================
Total params: 324,105
Trainable params: 324,105
Non-trainable params: 0
_________________________________________________________________
