Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 32, 48, 48)        896       
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 32, 46, 46)        9248      
_________________________________________________________________
flatten_3 (Flatten)          (None, 67712)             0         
_________________________________________________________________
dense_4 (Dense)              (None, 9)                 609417    
=================================================================
Total params: 619,561
Trainable params: 619,561
Non-trainable params: 0
_________________________________________________________________
