Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 32, 48, 48)        896       
_________________________________________________________________
flatten_2 (Flatten)          (None, 73728)             0         
_________________________________________________________________
dense_3 (Dense)              (None, 9)                 663561    
=================================================================
Total params: 664,457
Trainable params: 664,457
Non-trainable params: 0
_________________________________________________________________
