Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_19 (Conv2D)           (None, 32, 48, 48)        896       
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 32, 24, 24)        0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 64, 22, 22)        18496     
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 64, 11, 11)        0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 64, 11, 11)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 128, 11, 11)       73856     
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 128, 5, 5)         0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 256, 3, 3)         295168    
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 256, 1, 1)         0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 256, 1, 1)         0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 9)                 2313      
=================================================================
Total params: 390,729
Trainable params: 390,729
Non-trainable params: 0
_________________________________________________________________
