Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 64, 48, 48)        1792      
_________________________________________________________________
flatten_4 (Flatten)          (None, 147456)            0         
_________________________________________________________________
dense_5 (Dense)              (None, 9)                 1327113   
=================================================================
Total params: 1,328,905
Trainable params: 1,328,905
Non-trainable params: 0
_________________________________________________________________
