Model: "model_doubleconv64_opt=adamax_ker=3_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_57 (Conv2D)           (None, 32, 48, 1)         13856     
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 32, 48, 1)         9248      
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 64, 24, 1)         9280      
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 64, 24, 1)         36928     
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_30 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_29 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_30 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 170,185
Trainable params: 170,185
Non-trainable params: 0
_________________________________________________________________
