Model: "model_singleconv_wdropout_64_act=relu_opt=adam_ker=3_pad=same_drop=20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 32, 48, 1)         13856     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 24, 1)         9280      
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 384)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_12 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 124,009
Trainable params: 124,009
Non-trainable params: 0
_________________________________________________________________
