Model: "model_doubleconv64_opt=adamax_ker=5_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_73 (Conv2D)           (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_37 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_76 (Conv2D)           (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_38 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_19 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_37 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_38 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
