Model: "model_doubleconv64_opt=adam_ker=5_drop=50.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_157 (Conv2D)          (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_158 (Conv2D)          (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_79 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_79 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_159 (Conv2D)          (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_160 (Conv2D)          (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_80 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_80 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_40 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_79 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_80 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
