Model: "model_singleconv_32_act=relu_opt=adam_ker=3_pad=same_drop=20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 48, 3)         13856     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 24, 3)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1152)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               295168    
_________________________________________________________________
dense_2 (Dense)              (None, 9)                 2313      
=================================================================
Total params: 311,337
Trainable params: 311,337
Non-trainable params: 0
_________________________________________________________________
