Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_31 (Conv2D)           (None, 32, 48, 48)        896       
_________________________________________________________________
average_pooling2d_1 (Average (None, 32, 24, 24)        0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 64, 22, 22)        18496     
_________________________________________________________________
average_pooling2d_2 (Average (None, 64, 11, 11)        0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 64, 11, 11)        0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 128, 11, 11)       73856     
_________________________________________________________________
average_pooling2d_3 (Average (None, 128, 5, 5)         0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 256, 3, 3)         295168    
_________________________________________________________________
average_pooling2d_4 (Average (None, 256, 1, 1)         0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 256, 1, 1)         0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 256)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 390,729
Trainable params: 390,729
Non-trainable params: 0
_________________________________________________________________
