Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 32, 48, 48)        896       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 64, 46, 46)        18496     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 64, 23, 23)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 64, 23, 23)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 128, 23, 23)       73856     
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 256, 21, 21)       295168    
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 256, 10, 10)       0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 256, 10, 10)       0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 25600)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 9)                 230409    
=================================================================
Total params: 618,825
Trainable params: 618,825
Non-trainable params: 0
_________________________________________________________________
