Model: "model_singleconv_wdropout_256_act=relu_opt=adam_ker=3_pad=same_drop=20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 32, 48, 3)         13856     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 16, 24, 3)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 24, 3)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 24, 3)         9280      
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 32, 12, 3)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 12, 3)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 128, 12, 3)        36992     
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 64, 6, 3)          0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 64, 6, 3)          0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 256, 6, 3)         147712    
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 128, 3, 3)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 128, 3, 3)         0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 1152)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 256)               295168    
_________________________________________________________________
dense_16 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 505,321
Trainable params: 505,321
Non-trainable params: 0
_________________________________________________________________
