Model: "model_doubleconv64_opt=sgd_ker=3_drop=10.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_25 (Conv2D)           (None, 32, 48, 1)         13856     
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 32, 48, 1)         9248      
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 64, 24, 1)         9280      
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 64, 24, 1)         36928     
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_33 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_34 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 170,185
Trainable params: 170,185
Non-trainable params: 0
_________________________________________________________________
