Model: "model_doubleconv64_opt=adamax_ker=7_drop=20.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_45 (Conv2D)           (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_23 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_24 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_23 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_24 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
