Model: "model_doubleconv64_opt=sgd_ker=3_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_217 (Conv2D)          (None, 32, 48, 1)         13856     
_________________________________________________________________
conv2d_218 (Conv2D)          (None, 32, 48, 1)         9248      
_________________________________________________________________
max_pooling2d_113 (MaxPoolin (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_105 (Dropout)        (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_219 (Conv2D)          (None, 64, 24, 1)         9280      
_________________________________________________________________
conv2d_220 (Conv2D)          (None, 64, 24, 1)         36928     
_________________________________________________________________
max_pooling2d_114 (MaxPoolin (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_106 (Dropout)        (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_65 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_129 (Dense)            (None, 256)               98560     
_________________________________________________________________
dense_130 (Dense)            (None, 9)                 2313      
=================================================================
Total params: 170,185
Trainable params: 170,185
Non-trainable params: 0
_________________________________________________________________
