Model: "model_doubleconv64_opt=sgd_ker=3_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 32, 48, 1)         13856     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 32, 48, 1)         9248      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 64, 24, 1)         9280      
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 64, 24, 1)         36928     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 384)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 256)               98560     
_________________________________________________________________
dense_6 (Dense)              (None, 9)                 2313      
=================================================================
Total params: 170,185
Trainable params: 170,185
Non-trainable params: 0
_________________________________________________________________
