Model: "model_doubleconv_nodrop_64_opt=adam_ker=3_drop=20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 48, 3)         13856     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 48, 3)         9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 24, 3)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 24, 3)         9280      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 24, 3)         36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 12, 3)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 1152)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 256)               295168    
_________________________________________________________________
dense_4 (Dense)              (None, 9)                 2313      
=================================================================
Total params: 366,793
Trainable params: 366,793
Non-trainable params: 0
_________________________________________________________________
