Model: "model_doubleconv64_opt=rmsprop_ker=7_drop=10.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_101 (Conv2D)          (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_102 (Conv2D)          (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_51 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_51 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_103 (Conv2D)          (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_104 (Conv2D)          (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_52 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_52 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_26 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_51 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_52 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
