Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 48, 48)        896       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 46, 46)        9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 23, 23)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 23, 23)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 23, 23)        18496     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 21, 21)        36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 64, 10, 10)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 64, 10, 10)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 128, 10, 10)       73856     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 128, 8, 8)         147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 128, 4, 4)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 128, 4, 4)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               1049088   
_________________________________________________________________
dropout_4 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 9)                 4617      
=================================================================
Total params: 1,340,713
Trainable params: 1,340,713
Non-trainable params: 0
_________________________________________________________________
