Model: "model_doubleconv64_opt=adamax_ker=5_drop=10.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_65 (Conv2D)           (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_66 (Conv2D)           (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_33 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_67 (Conv2D)           (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_68 (Conv2D)           (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_34 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_33 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_34 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
