Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 32, 48, 48)        896       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 64, 46, 46)        18496     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 128, 44, 44)       73856     
_________________________________________________________________
flatten_4 (Flatten)          (None, 247808)            0         
_________________________________________________________________
dense_5 (Dense)              (None, 9)                 2230281   
=================================================================
Total params: 2,323,529
Trainable params: 2,323,529
Non-trainable params: 0
_________________________________________________________________
