Model: "model_doubleconv64_opt=rmsprop_ker=5_drop=30.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_29 (Conv2D)           (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 384)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_16 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
