Model: "model_doubleconv64_opt=adam_ker=5_drop=30.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_149 (Conv2D)          (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_150 (Conv2D)          (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_75 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_75 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_151 (Conv2D)          (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_152 (Conv2D)          (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_76 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_76 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_38 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_75 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_76 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
