Model: "model_doubleconv64_opt=rmsprop_ker=3_drop=20.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 32, 48, 1)         13856     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 32, 48, 1)         9248      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 64, 24, 1)         9280      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 64, 24, 1)         36928     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 384)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 256)               98560     
_________________________________________________________________
dense_4 (Dense)              (None, 9)                 2313      
=================================================================
Total params: 170,185
Trainable params: 170,185
Non-trainable params: 0
_________________________________________________________________
