Model: "model_doubleconv64_opt=sgd_ker=5_drop=50.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_61 (Conv2D)           (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_64 (Conv2D)           (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_26 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_51 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_52 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
