Model: "model_doubleconv64_opt=sgd_ker=7_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_77 (Conv2D)           (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_78 (Conv2D)           (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_43 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_35 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_79 (Conv2D)           (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_44 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_36 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_30 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_59 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_60 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
