Model: "model_doubleconv64_opt=sgd_ker=5_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_237 (Conv2D)          (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_238 (Conv2D)          (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_123 (MaxPoolin (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_115 (Dropout)        (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_239 (Conv2D)          (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_240 (Conv2D)          (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_124 (MaxPoolin (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_116 (Dropout)        (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_70 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_139 (Dense)            (None, 256)               98560     
_________________________________________________________________
dense_140 (Dense)            (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
