Model: "model_doubleconv64_opt=adamax_ker=3_drop=30.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_53 (Conv2D)           (None, 32, 48, 1)         13856     
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 32, 48, 1)         9248      
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 64, 24, 1)         9280      
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 64, 24, 1)         36928     
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_28 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 170,185
Trainable params: 170,185
Non-trainable params: 0
_________________________________________________________________
