Model: "model_doubleconv64_opt=sgd_ker=7_drop=50.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_261 (Conv2D)          (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_262 (Conv2D)          (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_135 (MaxPoolin (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_127 (Dropout)        (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_263 (Conv2D)          (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_264 (Conv2D)          (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_136 (MaxPoolin (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_128 (Dropout)        (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_76 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_151 (Dense)            (None, 256)               98560     
_________________________________________________________________
dense_152 (Dense)            (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
