Model: "model_doubleconv64_opt=adam_ker=7_drop=30.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_169 (Conv2D)          (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_170 (Conv2D)          (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_85 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_85 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_171 (Conv2D)          (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_172 (Conv2D)          (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_86 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_86 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_43 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_85 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_86 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
