Model: "model_doubleconv64_opt=adam_ker=7_drop=20.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_165 (Conv2D)          (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_166 (Conv2D)          (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_83 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_83 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_167 (Conv2D)          (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_168 (Conv2D)          (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_84 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_84 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_83 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_84 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
