Model: "model_doubleconv64_opt=adam_ker=7_drop=50.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_177 (Conv2D)          (None, 32, 48, 1)         75296     
_________________________________________________________________
conv2d_178 (Conv2D)          (None, 32, 48, 1)         50208     
_________________________________________________________________
max_pooling2d_89 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_89 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_179 (Conv2D)          (None, 64, 24, 1)         50240     
_________________________________________________________________
conv2d_180 (Conv2D)          (None, 64, 24, 1)         200768    
_________________________________________________________________
max_pooling2d_90 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_90 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_45 (Flatten)         (None, 384)               0         
_________________________________________________________________
dense_89 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_90 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 477,385
Trainable params: 477,385
Non-trainable params: 0
_________________________________________________________________
