Model: "model_doubleconv64_opt=rmsprop_ker=5_drop=40.0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 32, 48, 1)         38432     
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 32, 48, 1)         25632     
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 16, 24, 1)         0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 64, 24, 1)         25664     
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 64, 24, 1)         102464    
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 32, 12, 1)         0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 32, 12, 1)         0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 384)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 256)               98560     
_________________________________________________________________
dense_18 (Dense)             (None, 9)                 2313      
=================================================================
Total params: 293,065
Trainable params: 293,065
Non-trainable params: 0
_________________________________________________________________
