Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 32, 48, 48)        896       
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 64, 46, 46)        18496     
_________________________________________________________________
flatten_3 (Flatten)          (None, 135424)            0         
_________________________________________________________________
dense_4 (Dense)              (None, 9)                 1218825   
=================================================================
Total params: 1,238,217
Trainable params: 1,238,217
Non-trainable params: 0
_________________________________________________________________
