Model: "model_singleconv_256_opt=adam_ker=3_drop=20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 48, 1)         13856     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 24, 1)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 24, 1)         9280      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 12, 1)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 12, 1)        36992     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 64, 6, 1)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 256, 6, 1)         147712    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 128, 3, 1)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 384)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 256)               98560     
_________________________________________________________________
dense_8 (Dense)              (None, 9)                 2313      
=================================================================
Total params: 308,713
Trainable params: 308,713
Non-trainable params: 0
_________________________________________________________________
